---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyAttachedType
source: html/384b2cc9-d6ea-3d8d-052a-cbb890885ed7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyAttachedType Property

Cannot copy attached detail group type without copying the model group type it refers to.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyAttachedType { get; }
```